import logo from "../../assets/images/logo.png";
import frontend from "../../assets/images/frontend.png";
import backend from "../../assets/images/backend.png";

export const blocks = [
  {
    title: "关于我们",
    paragraphs: [
      "C.A.T工作室，成立于2017年，指导老师为梁祖红老师，分为前端和后台两个小组。",
      "我们长期专注于计算机技术在智慧电网领域的应用，鼓励学生全程参与实践工程项目设计与开发工作，在实践创新中快速成长。工作室一直与自动化学院智慧能源与电力研创中心保持紧密合作并取得丰厚成果，已完成南方电网广州、湛江、清远、汕头和韶关等地市局，基于大数据应用分析的智能配电网辅助决策系统开发工作。同时，申请专利30余项，软著2项，发表论文20余篇，同时组队参与App、小程序设计大赛、蓝桥杯并获得省级和国家级奖项。工作室已有大批师兄师姐进入了腾讯、阿里巴巴、字节跳动、南方电网等龙头企业工作",
    ],
    color: "rgba(0,0,0,0)",
    image: logo,
  },
  {
    title: "工作室成就",
    paragraphs: [
      "● 智能塑料瓶回收箱",
      "● 上腾科技云平台系统",
      "● “百货校园行”小程序",
      "● 美丽乡村智慧社区平台",
      "● 广州市供电局运营分析平台",
      "● 清远市输电运维决策支持系统",
      "● 国家海洋局南海分局北斗航标系统",
      "● 广东玉兰集团有限公司B2B订单系统",
      "● 韶关市供电局-基于GIS的可视化规划平台",
      "● 汕头、湛江的智能配电网辅助决策系统",
      "● 南方电网——基于GIS的智能配电网自动规划系统",
    ],
    color: "rgba(0,0,0,0)",
  },
  {
    title: "前端开发",
    paragraphs: [
      "前端即网站前台部分，负责页面设计开发以及业务逻辑的实现，我们平时在浏览器中看到各式各样的页面基本都是出自前端之手，随着大前端的到来，前端现在不仅能开发网页，通过node.js还能完成后台开发。",
      "C.A.T工作室前端组主要基于HTML、CSS、JavaScript等基础前端编程语言进行开发，同时引入处于前沿的前端技术（框架、工具库等）对项目进行进一步的构建、优化。我们致力于打造页面视觉效果更优、用户体验更佳、功能更强大的网站、App、小程序等产品。我们不局限于页面展示,同时也聚焦业务逻辑，做我们“想做、会做、能做”的事。如果你对前端有足够的热爱，对技术有足够的热情，有足够的毅力，那就请你加入我们吧！",
    ],
    image: frontend,
    color: "rgba(0,0,0,0)",
  },
  {
    title: "后台开发",
    paragraphs: [
      "后台开发，通常也称服务器端开发。主要负责业务逻辑处理，工作中处理前端的请求，进行逻辑处理和数据交互，现阶段的Web端、移动端等都需要后台技术的支持。",
      "C.A.T工作室后台组基于Java语言开发，自成立以来，和政府、企业等多有合作，将主要精力聚焦在校外，致力于开发智能电网辅助决策系统等大型项目。各类大型项目使得我们的技术水平日益精进，如果你想要提升自己的编程水平，积累自己的项目经验，同时具备坚实的Java语言基础，对服务器端编程感兴趣，有出色的学习能力以及良好的团队协作能力，那么后台组绝对是你的不二选择。",
    ],
    color: "rgba(0,0,0,0)",
    image: backend,
  },
  {
    title: "Q & A",
    paragraphs: [
      "Q：欢迎零基础的报名参加工作室吗？",
      "A：当然是欢迎的啊！现在零基础也是没关系哦，我们更看重的是你的学习能力与学习热情，有潜力的人当然也是我们的目标，所以大胆报名吧！希望你能成为我们的中流砥柱。",
      "Q：工作室的学习环境如何？",
      "A：就环境来说，工作室在创谷拥有专属超大单人工位，离教学楼近，方便我们上下课的同时还提供免费空调，网络，专业书籍，师兄师姐的现场指导，实体服务器和公用会议室等，我们还能在做项目的过程中领取相当丰厚的项目补助。",
      "Q：工作室的规章制度是怎么样的？",
      "A：我们并没有严格的打卡签到制度，相对弹性自由，可以由个人来合理规划自己的时间，在技术提升的同时，也能保证学业的进步，但也希望进来的小伙伴能够自律自觉完成学习任务。",
      "Q：招新流程是怎么样的？",
      "A：今年的招新流程为：面试、一轮考核、二轮考核。面试主要是想了解一下大家的性格，两次考核则是为了检验大家的学习能力和专业技能。",
    ],
    color: "rgba(0,0,0,0)",
  },
];
